# Ex3 - Getting and Knowing your Dataexercises

### Step 1. Import the necessary libraries

In [40]:
import pandas as pd

### Step 2. Import the dataset from this [address](https://raw.githubusercontent.com/justmarkham/DAT8/master/data/u.user).

### Step 3. Assign it to a variable called users and use the 'user_id' as index

In [41]:
users = pd.read_csv("https://raw.githubusercontent.com/justmarkham/DAT8/master/data/u.user", sep="|", index_col="user_id")
users

         age gender     occupation zip_code
user_id
1         24      M     technician    85711
2         53      F          other    94043
3         23      M         writer    32067
4         24      M     technician    43537
5         33      F          other    15213
...      ...    ...            ...      ...
939       26      F        student    33319
940       32      M  administrator    02215
941       20      M        student    97229
942       48      F      librarian    78209
943       22      M        student    77841

[943 rows x 4 columns]

### Step 4. See the first 25 entries

In [42]:
 users.iloc[:25, :]#desde el 0 hasta el 25 y todas las columnas

         age gender     occupation zip_code
user_id
1         24      M     technician    85711
2         53      F          other    94043
3         23      M         writer    32067
4         24      M     technician    43537
5         33      F          other    15213
6         42      M      executive    98101
7         57      M  administrator    91344
8         36      M  administrator    05201
9         29      M        student    01002
10        53      M         lawyer    90703
11        39      F          other    30329
12        28      F          other    06405
13        47      M       educator    29206
14        45      M      scientist    55106
15        49      F       educator    97301
16        21      M  entertainment    10309
17        30      M     programmer    06355
18        35      F          other    37212
19        40      M      librarian    02138
20        42      F      homemaker    95660
21        26      M         writer    30068
22        25      M         writer    40206
23        30      F         artist    48197
24        21      F         artist    94533
25        39      M       engineer    55107

In [43]:
users.loc[:25,:]

         age gender     occupation zip_code
user_id
1         24      M     technician    85711
2         53      F          other    94043
3         23      M         writer    32067
4         24      M     technician    43537
5         33      F          other    15213
6         42      M      executive    98101
7         57      M  administrator    91344
8         36      M  administrator    05201
9         29      M        student    01002
10        53      M         lawyer    90703
11        39      F          other    30329
12        28      F          other    06405
13        47      M       educator    29206
14        45      M      scientist    55106
15        49      F       educator    97301
16        21      M  entertainment    10309
17        30      M     programmer    06355
18        35      F          other    37212
19        40      M      librarian    02138
20        42      F      homemaker    95660
21        26      M         writer    30068
22        25      M         writer    40206
23        30      F         artist    48197
24        21      F         artist    94533
25        39      M       engineer    55107

In [44]:
users.head(25)

         age gender     occupation zip_code
user_id
1         24      M     technician    85711
2         53      F          other    94043
3         23      M         writer    32067
4         24      M     technician    43537
5         33      F          other    15213
6         42      M      executive    98101
7         57      M  administrator    91344
8         36      M  administrator    05201
9         29      M        student    01002
10        53      M         lawyer    90703
11        39      F          other    30329
12        28      F          other    06405
13        47      M       educator    29206
14        45      M      scientist    55106
15        49      F       educator    97301
16        21      M  entertainment    10309
17        30      M     programmer    06355
18        35      F          other    37212
19        40      M      librarian    02138
20        42      F      homemaker    95660
21        26      M         writer    30068
22        25      M         writer    40206
23        30      F         artist    48197
24        21      F         artist    94533
25        39      M       engineer    55107

In [45]:
#ejemplo
users.loc[:25, "age":"gender"]

         age gender
user_id
1         24      M
2         53      F
3         23      M
4         24      M
5         33      F
6         42      M
7         57      M
8         36      M
9         29      M
10        53      M
11        39      F
12        28      F
13        47      M
14        45      M
15        49      F
16        21      M
17        30      M
18        35      F
19        40      M
20        42      F
21        26      M
22        25      M
23        30      F
24        21      F
25        39      M

### Step 5. See the last 10 entries

In [46]:
users.tail(10)

         age gender     occupation zip_code
user_id
934       61      M       engineer    22902
935       42      M         doctor    66221
936       24      M          other    32789
937       48      M       educator    98072
938       38      F     technician    55038
939       26      F        student    33319
940       32      M  administrator    02215
941       20      M        student    97229
942       48      F      librarian    78209
943       22      M        student    77841

### Step 6. What is the number of observations in the dataset?

In [47]:
users.shape[0]

943

In [48]:
users.info()

<class 'pandas.core.frame.DataFrame'>
Int64Index: 943 entries, 1 to 943
Data columns (total 4 columns):
 #   Column      Non-Null Count  Dtype
---  ------      --------------  -----
 0   age         943 non-null    int64
 1   gender      943 non-null    object
 2   occupation  943 non-null    object
 3   zip_code    943 non-null    object
dtypes: int64(1), object(3)
memory usage: 76.8+ KB

In [49]:
users.index
#una de las formas de acceder al index.

Int64Index([  1,   2,   3,   4,   5,   6,   7,   8,   9,  10,
            ...
            934, 935, 936, 937, 938, 939, 940, 941, 942, 943],
           dtype='int64', name='user_id', length=943)

In [50]:
users.age.size

943

### Step 7. What is the number of columns in the dataset?

In [51]:
users.shape[1]

4

### Step 8. Print the name of all the columns.

In [52]:
users.columns

Index(['age', 'gender', 'occupation', 'zip_code'], dtype='object')

In [53]:
users.columns.values #nos transforma en un array de numpy - lo podemos utilizar

array(['age', 'gender', 'occupation', 'zip_code'], dtype=object)

In [54]:
for x in users.columns:
    print(x)

age
gender
occupation
zip_code

### Step 9. How is the dataset indexed?

In [55]:
# "the index" (aka "the labels")
users.index

Int64Index([  1,   2,   3,   4,   5,   6,   7,   8,   9,  10,
            ...
            934, 935, 936, 937, 938, 939, 940, 941, 942, 943],
           dtype='int64', name='user_id', length=943)

### Step 10. What is the data type of each column?

In [56]:
users.dtypes

age            int64
gender        object
occupation    object
zip_code      object
dtype: object

In [57]:
users.info()

<class 'pandas.core.frame.DataFrame'>
Int64Index: 943 entries, 1 to 943
Data columns (total 4 columns):
 #   Column      Non-Null Count  Dtype
---  ------      --------------  -----
 0   age         943 non-null    int64
 1   gender      943 non-null    object
 2   occupation  943 non-null    object
 3   zip_code    943 non-null    object
dtypes: int64(1), object(3)
memory usage: 76.8+ KB

### Step 11. Print only the occupation column

In [58]:
users.occupation

user_id
1         technician
2              other
3             writer
4         technician
5              other
           ...
939          student
940    administrator
941          student
942        librarian
943          student
Name: occupation, Length: 943, dtype: object

In [59]:
users["occupation"]

user_id
1         technician
2              other
3             writer
4         technician
5              other
           ...
939          student
940    administrator
941          student
942        librarian
943          student
Name: occupation, Length: 943, dtype: object

### Step 12. How many different occupations are in this dataset?

In [60]:
users.occupation.describe()#nos da las ocupaciones unicas (unique) de la coluna "ocupation"

count         943
unique         21
top       student
freq          196
Name: occupation, dtype: object

In [61]:
 users.occupation.value_counts()

student          196
other            105
educator          95
administrator     79
engineer          67
programmer        66
librarian         51
writer            45
executive         32
scientist         31
artist            28
technician        27
marketing         26
entertainment     18
healthcare        16
retired           14
lawyer            12
salesman          12
none               9
doctor             7
homemaker          7
Name: occupation, dtype: int64

In [62]:
users.occupation.value_counts().count()#con count() me da el total de ocupations.

21

In [63]:
users.occupation.unique()#me da los unicos de la columna occupation en un array.

array(['technician', 'other', 'writer', 'executive', 'administrator',
       'student', 'lawyer', 'educator', 'scientist', 'entertainment',
       'programmer', 'librarian', 'homemaker', 'artist', 'engineer',
       'marketing', 'none', 'healthcare', 'retired', 'salesman', 'doctor'],
      dtype=object)

In [64]:
users.occupation.nunique()# nos da el tamaño

21

### Step 13. What is the most frequent occupation?

In [65]:
users.occupation.mode()# moda, el valor con mas frequencia, que aparece más veces.

0    student
dtype: object

In [66]:
users.occupation.value_counts().max() #me da el valor maximo de ocupacion

196

In [67]:
users.occupation.value_counts().index[0]#con index[0] nos da el pr¡mero valor del indice

'student'

In [76]:
users_= users.groupby("occupation").count()
users_

               age  gender  zip_code
occupation
administrator   79      79        79
artist          28      28        28
doctor           7       7         7
educator        95      95        95
engineer        67      67        67
entertainment   18      18        18
executive       32      32        32
healthcare      16      16        16
homemaker        7       7         7
lawyer          12      12        12
librarian       51      51        51
marketing       26      26        26
none             9       9         9
other          105     105       105
programmer      66      66        66
retired         14      14        14
salesman        12      12        12
scientist       31      31        31
student        196     196       196
technician      27      27        27
writer          45      45        45

In [77]:
users_[users_.gender == users.occupation.value_counts().max()]

            age  gender  zip_code
occupation
student     196     196       196

In [82]:
#el indice con mayor valor dentro de la serie value_counts()
users.occupation.value_counts().idxmax()

'student'

### Step 14. Summarize the DataFrame.

In [85]:
users.describe()#por defecto nos da el valor de las columnas numericas.

              age
count  943.000000
mean    34.051962
std     12.192740
min      7.000000
25%     25.000000
50%     31.000000
75%     43.000000
max     73.000000

### Step 15. Summarize all the columns

In [89]:
#por todas las columnas con un for hacemos un describe

for columns in users.columns:
    print(users[columns].describe())
    print("-----------")

count    943.000000
mean      34.051962
std       12.192740
min        7.000000
25%       25.000000
50%       31.000000
75%       43.000000
max       73.000000
Name: age, dtype: float64
-----------
count     943
unique      2
top         M
freq      670
Name: gender, dtype: object
-----------
count         943
unique         21
top       student
freq          196
Name: occupation, dtype: object
-----------
count       943
unique      795
top       55414
freq          9
Name: zip_code, dtype: object
-----------

In [96]:
users.describe(include="all")

               age gender occupation zip_code
count   943.000000    943        943      943
unique         NaN      2         21      795
top            NaN      M    student    55414
freq           NaN    670        196        9
mean     34.051962    NaN        NaN      NaN
std      12.192740    NaN        NaN      NaN
min       7.000000    NaN        NaN      NaN
25%      25.000000    NaN        NaN      NaN
50%      31.000000    NaN        NaN      NaN
75%      43.000000    NaN        NaN      NaN
max      73.000000    NaN        NaN      NaN

### Step 16. Summarize only the occupation column

In [97]:
users.occupation.describe()

count         943
unique         21
top       student
freq          196
Name: occupation, dtype: object

### Step 17. What is the mean age of users?

In [98]:
users.age.mean()

34.05196182396607

In [99]:
users.age.mean().round(2)

34.05

### Step 18. What is the age with least occurrence?

In [101]:
users.age.value_counts().min()#nos da el valor minimo de la serie value_counts en age.

1